# Data Science Pandas - Joins, Time Series & Rolling Statistics

## Tasks Today:

1) <b>Pandas</b> <br>
 &nbsp;&nbsp;&nbsp;&nbsp; a) Joins <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - merge() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Breaking Down the Inner Join <br>
 &nbsp;&nbsp;&nbsp;&nbsp; b) Outer Joins <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Use Case Example <br>
 &nbsp;&nbsp;&nbsp;&nbsp; c) Rolling Statistics and Time Series w/Pandas <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - read_csv() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - shift() <br>

In [1]:
import pandas as pd
import numpy as np

### Joins <br>
<p>Very often you will have to combine data from several different sources to obtain the actual dataset you need for your exploration or modeling. Pandas draws heavily on SQL in its API design for joins, and if you are familiar with SQL joins, then Pandas will come naturally. Imagine you have two tables, one with customer name and gender, and the other with their purchases:</p>

In [3]:
city_data = {
    1: 'Chicago',
    2: 'Boston',
    3: 'New York',
    4: 'San Francisco',
    5: 'Washington,DC'
}

ages = np.random.randint(18,65,100)
city = [city_data[num] for num in np.random.randint(1,6,100)]
customer_id = np.arange(1000,1100)

<p>Let's assume we have a dataset containing the customer ID's cities, and ages for a set of customers. Suppose further, that we have a second table, containing some customer ID's, and a feedback survey rating from those customers. Suppose finally, that you as an analyst are asked the following question: What city tends to give the best feedback for our product? We'll need a join operation to get the answer.</p>

In [5]:
customer_demo= pd.DataFrame.from_dict({
    
    'ages' : ages,
    'city':city,
    'customer_id': customer_id
    
})

customer_demo

    ages           city  customer_id
0     54  San Francisco         1000
1     55         Boston         1001
2     34         Boston         1002
3     19  Washington,DC         1003
4     48  Washington,DC         1004
..   ...            ...          ...
95    42         Boston         1095
96    25       New York         1096
97    57  Washington,DC         1097
98    33         Boston         1098
99    52        Chicago         1099

[100 rows x 3 columns]

In [8]:
customer_id = np.random.randint(1000,1200,100)
customer_rating = np.random.randint(1,11,100)

surveys = pd.DataFrame.from_dict({
    'customer_id' : customer_id,
    'customer_rating' : customer_rating
    
})

surveys.head(20)

    customer_id  customer_rating
0          1129                3
1          1043               10
2          1052                5
3          1109                1
4          1021                1
5          1060                1
6          1092                6
7          1145                6
8          1182                2
9          1157                3
10         1085                7
11         1030                9
12         1158                6
13         1107                9
14         1003                5
15         1146                5
16         1096                1
17         1023                4
18         1117                6
19         1149               10

##### merge()

<p>We can zip the two dataframes up with an inner join, using the Pandas API as follows:</p>

In [16]:
demo_ratings = customer_demo.merge(surveys, on = 'customer_id', how = 'inner')
demo_ratings


# drop some duplicates _ DONTS DROP ON THE ACTUAL DATAFRAME

#Can specify what occurenses using Keep see documantation
demo_ratings_dropped = demo_ratings.drop_duplicates(subset = 'customer_id').reset_index()#keeps org index
demo_ratings_dropped

demo_ratings_dropped = demo_ratings.drop_duplicates(subset = 'customer_id').reset_index(drop = True) # drops orig index
demo_ratings_dropped

    ages           city  customer_id  customer_rating
0     55         Boston         1001                4
1     34         Boston         1002                1
2     19  Washington,DC         1003                5
3     52  Washington,DC         1005                2
4     33         Boston         1006                4
5     38        Chicago         1010                5
6     36        Chicago         1011               10
7     47        Chicago         1012                9
8     18       New York         1017                3
9     33        Chicago         1021                1
10    61  Washington,DC         1023                4
11    22  San Francisco         1024                2
12    60        Chicago         1025                4
13    20  San Francisco         1026                9
14    34  San Francisco         1027                3
15    55       New York         1030                9
16    54       New York         1032                8
17    28       New York         1033                6
18    39       New York         1034                8
19    48         Boston         1036                7
20    58  San Francisco         1038                7
21    44         Boston         1039                4
22    61       New York         1043               10
23    44        Chicago         1049                8
24    56  San Francisco         1052                5
25    60        Chicago         1057                5
26    64  Washington,DC         1060                1
27    23  San Francisco         1062                5
28    25  San Francisco         1066                5
29    63        Chicago         1067                4
30    25  Washington,DC         1068                4
31    25       New York         1072                6
32    24         Boston         1073                1
33    49       New York         1074                3
34    20  San Francisco         1080                5
35    26  Washington,DC         1082                6
36    27         Boston         1085                7
37    63        Chicago         1089               10
38    62  San Francisco         1092                6
39    25       New York         1096                1
40    57  Washington,DC         1097                1

<p>Now it's a simple groupby operation to reveal the answer:</p>

In [20]:
#values fo cust ratings as per city
demo_ratings_dropped.groupby('city', as_index = False).mean().round(decimals = 2)[['ages', 'customer_rating', 'city']]


#FOR JUST BOSTON Use .loc[0]
demo_ratings_dropped.groupby('city', as_index = False).mean().round(decimals = 2)[['ages', 'customer_rating', 'city']].loc[0]

ages                37.86
customer_rating         4
city               Boston
Name: 0, dtype: object

In [19]:
#  USING as_index = True  - This makes the City column  the index which, we generally don't want .

#.loc GIVES YOU ACCESS TO THE INDEX

demo_ratings_dropped.groupby('city', as_index = True).mean().loc['Boston']

ages                 37.857143
customer_id        1034.571429
customer_rating       4.000000
Name: Boston, dtype: float64

##### Breaking Down the Inner Join <br>
<p>Let's take a closer look at the actual mechanics here however. There is some subtlety and nuance that is best understood by thinking of an inner join as two steps: a cartesian product, and then a filter. Observe the result of the following inner join:</p>

In [30]:
#merge = INNER JOIN 
d = {
    'a_id':[1,2,3,4],
    'b_field': ['a','b', 'c', 'd']
}

df1 = pd.DataFrame.from_dict(d)
df1

   a_id b_field
0     1       a
1     2       b
2     3       c
3     4       d

In [31]:
d2 = {
    'a_id':[1,2,6,2],
    'c_field': ['e','f', 'g','h']
}
df2 = pd.DataFrame.from_dict(d2)

df2

   a_id c_field
0     1       e
1     2       f
2     6       g
3     2       h

In [33]:
df1.merge(df2, on='a_id', how ='inner') # takes the match a values form both dataframes

   a_id b_field c_field
0     1       a       e
1     2       b       f
2     2       b       h

<p>Somehow, we ended up with more rows in the result than either of the original tables! This is because we joined on a $\textit{non-unique index}$. The join starts by computing all the possible combinations of rows, and then filters them based on the condition. Because of the duplicates, multiple combinations of rows make it through!</p>

### Outer Joins <br>
<p>An $\textit{outer join}$ produces all of the rows from the left table, and joins whatever rows it can to the right table, filling anywhere it cant with NaN's or None values. Below is a brief example, and then we will discuss a possible use case for this type of join.</p>

In [35]:
df3 = pd.DataFrame.from_dict({
    'A':[1,2,3],
   'B':['a','b','c']
})

df4 = pd.DataFrame.from_dict({
    'A': [1],
    'C':['d']
})

In [36]:
df3

   A  B
0  1  a
1  2  b
2  3  c

In [37]:
df4

   A  C
0  1  d

In [39]:
# This about how you data is goint to look 
df3.merge(df4, on ='A', how = 'outer')

   A  B    C
0  1  a    d
1  2  b  NaN
2  3  c  NaN

In [40]:
# Change the dataframs that is on the left still bring in all the data form both tables??
df4.merge(df3, on ='A', how = 'outer')

   A    C  B
0  1    d  a
1  2  NaN  b
2  3  NaN  c

In [41]:

# left inner join
df3.merge(df4, on ='A', how = 'left')

   A  B    C
0  1  a    d
1  2  b  NaN
2  3  c  NaN

In [43]:
df3.merge(df4, on ='A', how = 'right')

   A  B  C
0  1  a  d

##### Use Case Example

<p>As an example use case, let's imagine we have again the demographics and survey response tables from above:</p>

In [44]:
customer_demo.head()

   ages           city  customer_id
0    54  San Francisco         1000
1    55         Boston         1001
2    34         Boston         1002
3    19  Washington,DC         1003
4    48  Washington,DC         1004

In [46]:
surveys.head()

   customer_id  customer_rating
0         1129                3
1         1043               10
2         1052                5
3         1109                1
4         1021                1

<p>Now, you are asked as an analyst to compare the demographics of survey responders to the demographics of all your customers combined.</p>

In [52]:
demo_outer_surveys = customer_demo.merge(surveys, on='customer_id', how='outer')
#demo_outer_surveys

print("Demo suryeys Outer with N/A")
demo_outer_surveys['customer_rating'] = demo_outer_surveys['customer_rating'].fillna('N/A')
demo_outer_surveys.head(20)

# you could see who has not filled out your survey

Demo suryeys Outer with N/A

    ages           city  customer_id customer_rating
0   54.0  San Francisco         1000             N/A
1   55.0         Boston         1001               4
2   34.0         Boston         1002               1
3   19.0  Washington,DC         1003               5
4   48.0  Washington,DC         1004             N/A
5   52.0  Washington,DC         1005               2
6   33.0         Boston         1006               4
7   33.0         Boston         1006               7
8   50.0  San Francisco         1007             N/A
9   24.0        Chicago         1008             N/A
10  45.0  Washington,DC         1009             N/A
11  38.0        Chicago         1010               5
12  36.0        Chicago         1011              10
13  47.0        Chicago         1012               9
14  47.0  Washington,DC         1013             N/A
15  21.0       New York         1014             N/A
16  53.0  Washington,DC         1015             N/A
17  52.0         Boston         1016             N/A
18  18.0       New York         1017               3
19  30.0  Washington,DC         1018             N/A

In [53]:
demo_outer_surveys.groupby(['city', 'customer_rating']).size()
#so this is a count of all your customer ratings so you can see how many people have not done a survey

city           customer_rating
Boston         1.0                 3
               4.0                 3
               7.0                 3
               N/A                19
Chicago        1.0                 1
               4.0                 2
               5.0                 2
               8.0                 1
               9.0                 1
               10.0                2
               N/A                 8
New York       1.0                 1
               3.0                 2
               4.0                 1
               6.0                 2
               8.0                 2
               9.0                 1
               10.0                1
               N/A                 6
San Francisco  2.0                 1
               3.0                 1
               4.0                 1
               5.0                 4
               6.0                 1
               7.0                 1
               8.0                 1
               9.0                 1
               N/A                11
Washington,DC  1.0                 3
               2.0                 1
               3.0                 1
               4.0                 4
               5.0                 1
               6.0                 1
               N/A                15
dtype: int64

In [55]:
# avg age of peopple that answered survey
survey_answered = demo_outer_surveys[demo_outer_surveys['customer_rating'] != 'N/A']

#import math for rounding
import math
math.ceil(survey_answered['ages'].mean())

42

In [60]:
#vg age of peopple that DID NOTanswered survey

survey_non_answered = demo_outer_surveys[demo_outer_surveys['customer_rating'] == 'N/A']

 # math ceil rounds UP
math.ceil(survey_non_answered['ages'].mean())

#Normal rounding
round(survey_non_answered['ages'].mean())

#survey_non_answered['ages'].mean()

41.6271186440678

### Rolling Statistics and Time Series with Pandas

##### read_csv()

In [62]:
weather = pd.read_csv('../files/chiweather.csv', sep = ';')

In [63]:
weather.head(10)

,Year,Month,Day,Hour,Minute,Temperature [2 m above gnd],Total Precipitation [sfc],Wind speed [10 m above gnd],Wind direction [10 m above gnd]
0,2017,11,25,0,0,51.85,0.0,17.31,327.13
1,2017,11,25,1,0,49.14,0.0,20.53,330.64
2,2017,11,25,2,0,46.42,0.0,21.41,327.80
3,2017,11,25,3,0,44.13,0.0,21.79,324.19
4,2017,11,25,4,0,42.22,0.0,21.03,321.91
5,2017,11,25,5,0,40.75,0.0,19.62,316.85
6,2017,11,25,6,0,40.71,0.0,19.17,318.31
7,2017,11,25,7,0,39.22,0.0,18.51,313.53
8,2017,11,25,8,0,39.49,0.0,18.73,310.16
9,2017,11,25,9,0,40.73,0.0,19.80,311.79

In [66]:
weather_update = weather.groupby(['Year','Month','Day']).mean().reset_index()

In [68]:
weather_update.head(25)

,Year,Month,Day,Hour,Minute,Temperature [2 m above gnd],Total Precipitation [sfc],Wind speed [10 m above gnd],Wind direction [10 m above gnd]
0,2017,11,25,11.5,0.0,41.208750,0.000000,17.939583,325.761667
1,2017,11,26,11.5,0.0,38.298333,0.000000,11.435417,258.533750
2,2017,11,27,11.5,0.0,45.611250,0.000000,11.082500,188.377083
3,2017,11,28,11.5,0.0,48.497500,0.000000,17.418750,244.673333
4,2017,11,29,11.5,0.0,40.122917,0.020833,13.107083,167.510000
5,2017,11,30,11.5,0.0,43.618750,0.033333,14.343333,276.060000
6,2017,12,1,11.5,0.0,41.860417,0.000000,6.845000,223.459583
7,2017,12,2,11.5,0.0,45.324167,0.000000,8.934167,218.252500

##### shift() <br>
<p>Shift index by desired number of periods with an optional time freq</p>

In [70]:
#first print out the colunm aka keys SO YOU CAN COPY AND PASTE
print(weather_update.keys())

#Create new col with tranformen data
weather_update['last_temp'] = weather_update['Temperature  [2 m above gnd]'].shift(1)

Index(['Year', 'Month', 'Day', 'Hour', 'Minute',
       'Temperature  [2 m above gnd]', 'Total Precipitation  [sfc]',
       'Wind speed  [10 m above gnd]', 'Wind direction  [10 m above gnd]'],
      dtype='object')

In [71]:
weather_update

,Year,Month,Day,Hour,Minute,Temperature [2 m above gnd],Total Precipitation [sfc],Wind speed [10 m above gnd],Wind direction [10 m above gnd],last_temp
0,2017,11,25,11.5,0.0,41.208750,0.000000,17.939583,325.761667,NaN
1,2017,11,26,11.5,0.0,38.298333,0.000000,11.435417,258.533750,41.208750
2,2017,11,27,11.5,0.0,45.611250,0.000000,11.082500,188.377083,38.298333
3,2017,11,28,11.5,0.0,48.497500,0.000000,17.418750,244.673333,45.611250
4,2017,11,29,11.5,0.0,40.122917,0.020833,13.107083,167.510000,48.497500
5,2017,11,30,11.5,0.0,43.618750,0.033333,14.343333,276.060000,40.122917
6,2017,12,1,11.5,0.0,41.860417,0.000000,6.845000,223.459583,43.618750
7,2017,12,2,11.5,0.0,45.324167,0.000000,8.934167,218.252500,41.860417

In [74]:
# create a new column that takes the difference in temperature from the previous day as an absolute value
weather_update['difference'] = abs(weather_update['last_temp'] - weather_update['Temperature  [2 m above gnd]'])

weather_update

,Year,Month,Day,Hour,Minute,Temperature [2 m above gnd],Total Precipitation [sfc],Wind speed [10 m above gnd],Wind direction [10 m above gnd],last_temp,difference
0,2017,11,25,11.5,0.0,41.208750,0.000000,17.939583,325.761667,NaN,NaN
1,2017,11,26,11.5,0.0,38.298333,0.000000,11.435417,258.533750,41.208750,2.910417
2,2017,11,27,11.5,0.0,45.611250,0.000000,11.082500,188.377083,38.298333,7.312917
3,2017,11,28,11.5,0.0,48.497500,0.000000,17.418750,244.673333,45.611250,2.886250
4,2017,11,29,11.5,0.0,40.122917,0.020833,13.107083,167.510000,48.497500,8.374583
5,2017,11,30,11.5,0.0,43.618750,0.033333,14.343333,276.060000,40.122917,3.495833
6,2017,12,1,11.5,0.0,41.860417,0.000000,6.845000,223.459583,43.618750,1.758333
7,2017,12,2,11.5,0.0,45.324167,0.000000,8.934167,218.252500,41.860417,3.463750

In [76]:
#Connect to Database with Pandas
import sys
!{sys.executable} -m pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\cindy\anaconda3\lib\site-packages (2.8.5)

In [77]:
!{sys.executable} -m pip install SQLAlchemy

Requirement already satisfied: SQLAlchemy in c:\users\cindy\anaconda3\lib\site-packages (1.3.13)

In [81]:
#db connection string = 'postgresql://user:password@host:port/database'
connection = 'postgresql://postgres:Rasputin1@127.0.0.1:5432/dvd-rental-july2020-DB'

sql_DF = pd.read_sql_table('actor', con = connection)

In [82]:
sql_DF

     actor_id first_name     last_name             last_update
0           1   Penelope       Guiness 2013-05-26 14:47:57.620
1           2       Nick      Wahlberg 2013-05-26 14:47:57.620
2           3         Ed         Chase 2013-05-26 14:47:57.620
3           4   Jennifer         Davis 2013-05-26 14:47:57.620
4           5     Johnny  Lollobrigida 2013-05-26 14:47:57.620
..        ...        ...           ...                     ...
195       196       Bela        Walken 2013-05-26 14:47:57.620
196       197      Reese          West 2013-05-26 14:47:57.620
197       198       Mary        Keitel 2013-05-26 14:47:57.620
198       199      Julia       Fawcett 2013-05-26 14:47:57.620
199       200      Thora        Temple 2013-05-26 14:47:57.620

[200 rows x 4 columns]

In [90]:
# Write to a database using a DataFrame(Pandas) city 	customer_id 	customer_rating
from sqlalchemy.types import Integer, Text, String, DateTime, Float
#this create or replaces a new table, 
#chuck size means instreat of pushing everything down a pipeline -do in chunks. using default public schema
#can make the index False if you do not need it

If we make changes in jp norebook, then we have to rerun the code
demo_outer_surveys.to_sql('customer_surveys', connection, if_exists = 'replace', schema = 'public', index= True,
                        chunksize = 500, dtype = {
                            'ages': Integer,
                            'city': String,
                            'customer_id': Integer,
                        }
                        )